//Задача 1: Да се изведат на екрана числата от 1 до 100.

public class Task01_NumbersToOneHundred {

	public static void main(String[] args) {
		for (int num = 1; num <= 100; num++) {
			System.out.println(num);
		}

	}

}
