//Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен
//ред.
//10 9 8 7 6 5 4 3 2 1

public class Task04_NumbersDescendingOrder {

	public static void main(String[] args) {
		for (int num = 10; num >= 1; num--) {
			System.out.print(num + " ");
		}

	}

}
