//Задача 2: Да се изведат на екрана числат от -20 до 50.

public class Task02_NumbersMinus20To20 {

	public static void main(String[] args) {
		for (int num = -20; num <= 50; num++) {
			System.out.println(num);
		}

	}

}
