
//Задача 7:
//Имате предварително въведени стойности от естествени числа,
//въведени в квадратна таблица с размери 6 реда и 6 колони.
//Да се състави програма , чрез която се намира сумата на всички
//елементи, чиято сума на индекси за ред и колона е четно число.
//Програмата да извежда формираните суми за всеки отделен ред на
//квадратната таблица, както и общата сума от тези елементи.
//Да се използва само един цикъл.
//Пример:
//11,12,13,14,15,16,
//21,22,23,24,25,26,
//31,32,33,34,35,36,
//41,42,43,44,45,46,
//51,52,53,54,55,56,
//61,62,63,64,65,66
//Изход:
//11, ,13, ,15, , сума от елементите за реда: 39
//22, ,24, ,26, сума от елементите за реда: 72
//31, ,33, ,35, , сума от елементите за реда: 99
//42, ,44, ,46, сума от елементите за реда: 132
//51, ,53, ,55, , сума от елементите за реда: 159
//62, ,64, ,66 сума от елементите за реда: 192
//Сума на елементите: 693

public class Task07_EvenIndeciesSum {

	public static void main(String[] args) {
		int size = 6;
		int[][] matrix = { 
				{ 11, 12, 13, 14, 15, 16 },
				{ 21, 22, 23, 24, 25, 26 }, 
				{ 31, 32, 33, 34, 35, 36 },
				{ 41, 42, 43, 44, 45, 46 }, 
				{ 51, 52, 53, 54, 55, 56 },
				{ 61, 62, 63, 64, 65, 66 } 
			};
		int[] rowsSums = new int[size];
		int sum = 0;
		
		for (int row = 0; row < size; row++) {
			if (row % 2 == 0) {
				rowsSums[row] = matrix[row][0] + matrix[row][2] + matrix[row][4];
				System.out.println( matrix[row][0] + ", " + 
						matrix[row][2] + ", " + matrix[row][4] + 
						" сума от елементите за реда: " + rowsSums[row]);
			}
			else {
				rowsSums[row] = matrix[row][1] + matrix[row][3] + matrix[row][5];
				System.out.println( matrix[row][1] + ", " + 
						matrix[row][3] + ", " + matrix[row][5] + 
						" сума от елементите за реда: " + rowsSums[row]);
			}
			
			sum += rowsSums[row];
		}
		
		System.out.println("Сума на елементите: " + sum);

	}

}
